// pages/ledger/ledger.js
const app = getApp()

Page({

  /**
   * 页面的初始数据
   */
  data: {
    contentList: [["2023-8-2", "2023-8-3","2023-8-4", "2023-8-5", "2023-8-6", "2023-8-7", "2023-8-8", "2023-8-9", "2023-8-10", "2023-8-11", "2023-8-12", "2023-8-13", "2023-8-14", "2023-8-15", "2023-8-16"],["12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000", "12,000"], ["708", "708", "708", "708", "708", "708", "708", "708", "708", "708", "708", "708", "708", "708", "708 "]]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})